app/views/comments/_comments.html.erb


    <% @balloon.comments.each do | comment | %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."balloon_id" = ?  [["balloon_id", 1]]