app/controllers/api/v1/balloons_controller.rb

        def index
            @balloons = Balloon.order('created_at DESC');
---
SELECT "balloons".* FROM "balloons" ORDER BY created_at DESC