app/controllers/api/v1/comments_controller.rb

SELECT "comments".* FROM "comments" ORDER BY created_at DESC
---
        def index
            @comments = Comment.order('created_at DESC');