app/controllers/balloons_controller.rb

SELECT "balloons".* FROM "balloons"
---
    def index
        @title = "index - Balloons"
        @content = "This page displays a listing of all the balloons in our collection"
        @balloons = Balloon.all

SELECT  "balloons".* FROM "balloons" WHERE "balloons"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def show
        @title = "Show Balloon"
        @content = "This page displays the detail view for the selected balloon"
        @balloon = Balloon.find(params[:id])

SELECT  "balloons".* FROM "balloons" WHERE "balloons"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def edit
        @title = "Edit Balloon"
        @content = "This page displays you to Edit the selected balloon"
        @balloon = Balloon.find(params[:id])