app/controllers/counts_controller.rb

    def index
        @title = "Preview Seat Map"
        # see rubyOne for original implementation,
        @seatmap = Seatmap.find(params[:id])
---
SELECT  "seatmaps".* FROM "seatmaps" WHERE "seatmaps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]