app/controllers/seatmaps_controller.rb

    def index
        @title = "index - Seat Maps"
        @content = "This page displays a listing of all the seatmaps that are available"
        @seatmaps = Seatmap.all
---
SELECT "seatmaps".* FROM "seatmaps"

    def show
        @title = "Show Seat Map"
        @content = "This page displays the detail view for the selected Seat Map"
        @seatmap = Seatmap.find(params[:id])
---
SELECT  "seatmaps".* FROM "seatmaps" WHERE "seatmaps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @seatmap = Seatmap.new(seatmap_params)

        # validation - redirect if form saves successfully, esle redraw the new form
        if @seatmap.save()
---
INSERT INTO "seatmaps" ("title", "description", "rows", "seats", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def edit
        @title = "Edit Seat Map"
        @content = "This page enables you to Edit the selected Seat Map"
        @seatmap = Seatmap.find(params[:id])
---
SELECT  "seatmaps".* FROM "seatmaps" WHERE "seatmaps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @seatmap = Seatmap.find(params[:id])
        if @seatmap.update(seatmap_params)
---
SELECT  "seatmaps".* FROM "seatmaps" WHERE "seatmaps"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "seatmaps" SET "title" = ?, "description" = ?, "rows" = ?, "seats" = ?, "updated_at" = ? WHERE "seatmaps"."id" = ?  [["title", "test-seatmap22"], ["description", "seat 2 edit"], ["rows", "12"], ["seats", "30"], ["updated_at", "2019-09-18 02:50:47.101084"], ["id", 3]]

    def destroy
        @seatmap = Seatmap.find(params[:id])
        @seatmap.destroy
---
SELECT  "seatmaps".* FROM "seatmaps" WHERE "seatmaps"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "seatmaps" WHERE "seatmaps"."id" = ?  [["id", 2]]

    def generate
        @seatmap = Seatmap.find(params[:id])
---
SELECT  "seatmaps".* FROM "seatmaps" WHERE "seatmaps"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]